results_595/sglang/minimax-m2.7/1k1k/logs/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc2_1k1k.log
  0%|          | 0/40 [00:00<?, ?it/s]benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file='/results/sglang/minimax-m2.7/1k1k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc2_1k1k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=40, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file='/results/sglang/minimax-m2.7/1k1k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc2_1k1k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 40960
#Output tokens: 40960
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 40/40 [04:07<00:00,  6.18s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     40        
Benchmark duration (s):                  247.09    
Total input tokens:                      40960     
Total input text tokens:                 40960     
Total generated tokens:                  40960     
Total generated tokens (retokenized):    39739     
Request throughput (req/s):              0.16      
Input token throughput (tok/s):          165.77    
Output token throughput (tok/s):         165.77    
Peak output token throughput (tok/s):    168.00    
Peak concurrent requests:                4         
Total token throughput (tok/s):          331.54    
Concurrency:                             2.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   12353.08  
Median E2E Latency (ms):                 12341.92  
P90 E2E Latency (ms):                    12355.56  
P99 E2E Latency (ms):                    12563.00  
---------------Time to First Token----------------
Mean TTFT (ms):                          88.83     
Median TTFT (ms):                        77.53     
P99 TTFT (ms):                           283.70    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.99     
Median TPOT (ms):                        11.99     
P99 TPOT (ms):                           12.02     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           12.52     
Median ITL (ms):                         11.99     
P95 ITL (ms):                            12.10     
P99 ITL (ms):                            24.00     
Max ITL (ms):                            56.74     
==================================================